In [1]:
import pandas as pd
import numpy as np

In [103]:
df = pd.DataFrame({
    "Name" : ["A","B","C","A","E","F","C"],
    "part number" : ["1","3","2","1","5","1","2"],
    "detail1" : ["A","C","B","B","E","E","C"],
    "detail2" : ["one","three","two","two","five","five","five"]
})

In [59]:
df

  Name part number detail1 detail2
0    A           1       A     one
1    B           3       C   three
2    C           2       B     two
3    A           1       B     two
4    E           5       E    five
5    F           1       E    five
6    C           2       C    five

In [60]:
# df.groupby("part number")[["detail1","detail2"]].transform(deatail1+detail2)

In [61]:
df['Results'] = df['detail1'].shift()

In [62]:
df['Resultdd'] =df.groupby('Name')['part number'].shift()

In [4]:
df

    A    B
0  EQ  ANT
1  CB  ANT
2  CB   DQ
3  FF   DQ
4  EQ   BQ
5  EQ  VGQ
6  CB  GHB
7  CB  VGQ

## cHECKING FOR both "EQ'" AND "CQ"

In [92]:
df = pd.DataFrame({'A': ["EQ", "CB", "CB", "FF", "EQ", "EQ", "CB", "CB"],
                   'B': ["ANT", "ANT", "DQ", "DQ", "BQ", "VGQ", "GHB", "VGQ"]})
df

    A    B
0  EQ  ANT
1  CB  ANT
2  CB   DQ
3  FF   DQ
4  EQ   BQ
5  EQ  VGQ
6  CB  GHB
7  CB  VGQ

In [91]:
bala= df.B[df.A == 'EQ']
cala=df.B[df.A=='CB']
print(bala)
print(cala)

0    ANT
4     BQ
5    VGQ
Name: B, dtype: object
1    ANT
2     DQ
6    GHB
7    VGQ
Name: B, dtype: object

In [97]:
both = cala[cala.isin(bala)]
both

1    ANT
7    VGQ
Name: B, dtype: object

In [1]:
df[df['B'].isin(both)]

NameError: name 'df' is not defined

In [134]:
df=pd.read_clipboard()

In [174]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
dfa = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
                  index=index)
dfa.reset_index()

   Animal     Type  Max Speed
0  Falcon  Captive      390.0
1  Falcon     Wild      350.0
2  Parrot  Captive       30.0
3  Parrot     Wild       20.0

In [135]:
df.in

   desp Sex
0     a   m
1     a   m
2     b   f
3     a   f
4     b   m
5     c   f
6     b   m
7     c   f
8     c   m
9     b   f
10    a   f
11    b   m
12    c   f

In [186]:
idx = dfa.groupby(['Animal'])['Max Speed'].transform(max)== dfa['Max Speed']
idx

Animal  Type
Falcon  Captive     True
        Wild       False
Parrot  Captive     True
        Wild       False
Name: Max Speed, dtype: bool

                Max Speed
Animal Type
Falcon Captive      390.0
Parrot Captive       30.0

In [154]:
df

   desp Sex
0     a   m
1     a   m
2     b   f
3     a   f
4     b   m
5     c   f
6     b   m
7     c   f
8     c   m
9     b   f
10    a   f
11    b   m
12    c   f

In [215]:
g=df.groupby(['desp','Sex'])['Sex'].count()
g

desp  Sex
a     f      2
      m      2
b     f      2
      m      3
c     f      3
      m      1
Name: Sex, dtype: int64

In [217]:
a=pd.DataFrame({'count' : df.groupby( [ "desp", "Sex"] ).size()}).reset_index()
a

  desp Sex  count
0    a   f      2
1    a   m      2
2    b   f      2
3    b   m      3
4    c   f      3
5    c   m      1

In [190]:
aloo= a.groupby(['desp'])['count'].transform(max)== a['count']
aloo

0     True
1     True
2    False
3     True
4     True
5    False
Name: count, dtype: bool

In [194]:
df

   desp Sex
0     a   m
1     a   m
2     b   f
3     a   f
4     b   m
5     c   f
6     b   m
7     c   f
8     c   m
9     b   f
10    a   f
11    b   m
12    c   f

In [207]:
g=df.groupby(['desp','Sex'])['Sex'].count()

In [208]:
g

desp  Sex
a     f      2
      m      2
b     f      2
      m      3
c     f      3
      m      1
Name: Sex, dtype: int64

In [213]:
a=g.sort_values().groupby(level=0).tail(1)

In [214]:
a

desp  Sex
a     m      2
b     m      3
c     f      3
Name: Sex, dtype: int64

In [223]:
a=np.array([[1.74646146e+13],
       [6.56033448e+12],
       [7.41266564e+12],
       [1.84929707e+13],
       [1.03031800e+13],
       [2.13093693e+13],
       [5.51344947e+12],
       [1.66030190e+13],
       [3.05836516e+12],
       [8.43175724e+12]])

In [226]:
a.ravel()

array([  1.74646146e+13,   6.56033448e+12,   7.41266564e+12,
         1.84929707e+13,   1.03031800e+13,   2.13093693e+13,
         5.51344947e+12,   1.66030190e+13,   3.05836516e+12,
         8.43175724e+12])

In [229]:
import pandas as pd

d = {0: {50: 16, 23: 7, 22: 7, 5: 1, 31: 10, 47: 15, 2: 0, 44: 14, 39: 13, 21: 7, 11: 3, 30: 10, 16: 5, 42: 14, 26: 8, 1: 0, 40: 13, 32: 10, 34: 11, 46: 15, 49: 16, 15: 5, 37: 12, 9: 3, 12: 4, 41: 13, 24: 8, 10: 3, 18: 6, 8: 2, 33: 11, 35: 11, 0: 0, 36: 12, 27: 9, 48: 16, 38: 12, 7: 2, 28: 9, 3: 1, 29: 9, 43: 14, 4: 1, 45: 15, 17: 5, 14: 4, 13: 4, 19: 6, 25: 8, 20: 6, 6: 2}, 1: {50: 2, 23: 2, 22: 1, 5: 2, 31: 1, 47: 2, 2: 2, 44: 2, 39: 0, 21: 0, 11: 2, 30: 0, 16: 1, 42: 0, 26: 2, 1: 1, 40: 1, 32: 2, 34: 1, 46: 1, 49: 1, 15: 0, 37: 1, 9: 0, 12: 0, 41: 2, 24: 0, 10: 1, 18: 0, 8: 2, 33: 0, 35: 2, 0: 0, 36: 0, 27: 0, 48: 0, 38: 2, 7: 1, 28: 1, 3: 0, 29: 2, 43: 1, 4: 1, 45: 0, 17: 2, 14: 2, 13: 1, 19: 1, 25: 1, 20: 2, 6: 0}, 2: {50: 32, 23: 32, 22: 32, 5: 32, 31: 32, 47: 32, 2: 32, 44: 33, 39: 46, 21: 64, 11: 97, 30: 97, 16: 97, 42: 99, 26: 99, 1: 99, 40: 99, 32: 100, 34: 100, 46: 100, 49: 101, 15: 101, 37: 101, 9: 101, 12: 102, 41: 103, 24: 103, 10: 103, 18: 103, 8: 104, 33: 105, 35: 105, 0: 106, 36: 108, 27: 109, 48: 109, 38: 110, 7: 110, 28: 111, 3: 111, 29: 111, 43: 111, 4: 111, 45: 111, 17: 112, 14: 112, 13: 114, 19: 116, 25: 116, 20: 121, 6: 122}}
print (pd.DataFrame(d).pivot(0,1,2).applymap(chr).agg('8'.join))

1
0    j8o8z8e8f8e8g8@8g8m8a8i8l8.8c8o8m
1    c8o8n8g8r8a8t8 8t8o8 8d8e8c8o8d8e
2     8 8h8a8p8p8y8 8c8o8d8i8n8g8!8 8
dtype: object

In [241]:
np.random.seed(2)
np.random.rand(4)

array([ 0.4359949 ,  0.02592623,  0.54966248,  0.43532239])

In [243]:
np.random.seed(2)
np.random.rand(4)

array([ 0.4359949 ,  0.02592623,  0.54966248,  0.43532239])

In [2]:
n=2
arr1 = (np.random.randint(5, size=(n, 4)) // [2, 1, 2, 1]).astype(str)
arr1

array([['0', '1', '2', '0'],
       ['1', '2', '2', '3']],
      dtype='<U21')

In [48]:
df=pd.DataFrame({"date":["2020/2/29 12:40:0","2020/2/29 12:50:0"]})

In [51]:
df.date=pd.to_datetime(df.date)
df

                 date
0 2020-02-29 12:40:00
1 2020-02-29 12:50:00

In [52]:
df.date.dt.strftime("%d/%m")

0    29/02
1    29/02
Name: date, dtype: object